sargoliwork101-ui/ESP_APK_COOLLER/esp32_firmware/Cooler_ESP32_LightAPI/Cooler_ESP32_LightAPI.ino
/* =========================================================================
 *  Cooler ESP32 - Light API Firmware (for use with Android/WebView app)
 * =========================================================================
 *  این نسخه:
 *    • کل HTML/CSS/JS سنگین از روی فلش/پروگرم ESP32 حذف شده.
 *    • فقط REST/JSON API برای کنترل باقی مانده (کد ثابت < 2KB).
 *    • دو endpoint جدید اضافه شده:
 *        - GET /config    -> تنظیمات AP/STA/AP-cycle/protection (بدون پسورد)
 *        - GET /scenarios -> لیست سناریوهای فعال فعلی
 *    • CORS (Access-Control-Allow-Origin: *) برای همه‌ی پاسخ‌ها فعال است
 *      تا اپ اندروید (و حتی نسخه‌ی PWA) بدون مشکل با برد صحبت کند.
 *    • ظاهر و منطق UI دقیقاً مثل قبل، اما روی گوشی (WebView App یا PWA).
 *  منطق اصلی (سناریو، ساعت، NTP، رله، محافظت، آمار، چرخه‌ی AP/STA،
 *  رمزنگاری AES پسوردها، ذخیره‌سازی امن LittleFS، Watchdog) هیچ تغییری
 *  نکرده و فقط بخش ارسال HTML حذف شده است.
 * ========================================================================= */

#include <WiFi.h>
#include <WebServer.h>
#include <LittleFS.h>
#include <ArduinoJson.h>
#include <time.h>
#include <esp_task_wdt.h>
#include <stdarg.h>
#include "mbedtls/aes.h"

// ============================================================
//  بخش تنظیمات و ثابت‌ها (بدون تغییر نسبت به نسخه‌ی اصلی)
// ============================================================
const char* PROGRAM_NAME    = "کولر هوشمند ESP32";
const char* PROGRAM_TAGLINE = "ESP32 · TIMER HUB";
const int  RELAY_PIN = 23;
const int  RELAY_ACTIVE_LEVEL = HIGH;
const long NTP_GMT_OFFSET_SEC = 12600;
const unsigned char AES_KEY[16] = {
  0x4F, 0xA1, 0xC3, 0x92, 0x0E, 0x77, 0xB5, 0x2D,
  0x8C, 0x1A, 0x6F, 0xE4, 0x33, 0xD9, 0x5B, 0x88
};
char custom_ssid[32]     = "ESP32_Timer_Hub";
char custom_password[32] = "12345678";
char sta_ssid[32]     = "";
char sta_password[64] = "";
bool internet_enabled = true;
int  staOnMinutes  = 10;
int  staOffMinutes = 0;
const int MIN_STA_ON_MINUTES = 1;
const int MIN_STA_OFF_MINUTES = 0;
const int MAX_STA_CYCLE_MINUTES = 1440;
bool staCurrentlyOn = true;
unsigned long staCycleLastToggleMillis = 0;

bool apCycleEnabled = false;
int  apOnMinutes  = 10;
int  apOffMinutes = 5;
const int MIN_AP_CYCLE_MINUTES = 1;
const int MAX_AP_CYCLE_MINUTES = 1440;
bool apCurrentlyOn = true;
unsigned long apCycleLastToggleMillis = 0;
int apTxPowerLevel = 3;
const int MAX_AP_TX_POWER_LEVEL = 3;

const int MAX_SCENARIOS = 20;
int antiShortCycleMinutes = 3;
const int MAX_ANTI_SHORT_CYCLE_MINUTES = 1440;
unsigned long lastRelayOffMillis = 0;

const size_t SCENARIOS_JSON_CAPACITY = 6144;

const int STORAGE_FORMAT_REVISION = 6;
const int SCENARIOS_FILE_VERSION = 2;
const int WIFI_FILE_VERSION = 5;
const int TIME_FILE_VERSION = 2;
const int RELAY_STAT_FILE_VERSION = 2;
const int OVERRIDE_FILE_VERSION = 2;
const int PROTECTION_FILE_VERSION = 1;
const int NTP_META_FILE_VERSION = 1;

const int WDT_TIMEOUT_SEC = 8;
const unsigned long TIME_SAVE_INTERVAL = 5UL * 60UL * 1000UL;
const unsigned long NTP_RETRY_INTERVAL_MS = 1UL * 60UL * 1000UL;
const unsigned long NTP_RECHECK_INTERVAL_MS = 1UL * 60UL * 60UL * 1000UL;

WebServer server(80);

void feedWatchdog();

// ===== CORS helper =====
void sendCORS(){
  server.sendHeader("Access-Control-Allow-Origin", "*");
  server.sendHeader("Access-Control-Allow-Methods", "GET, POST, OPTIONS");
  server.sendHeader("Access-Control-Allow-Headers", "Content-Type");
}
void handleOptions(){
  sendCORS();
  server.send(204, "text/plain", "");
}

struct Scenario {
  bool active = false;
  bool enabled = false;
  int startHour = 0;
  int startMinute = 0;
  int endHour = 0;
  int endMinute = 0;
  uint8_t weekdays = 0x7F;
};
Scenario scenarios[MAX_SCENARIOS];

int currentHour = 0, currentMinute = 0, currentSecond = 0;
int currentYear = 2026, currentMonth = 1, currentDay = 1;
int currentWeekday = 3;
unsigned long lastTick = 0;

int manual_override = 0;
bool time_synchronized = false;
bool ntp_synced_this_boot = false;
bool ntpEverSucceeded = false;
bool ntpLastSuccessValid = false;
int ntpLastSuccessYear=2026, ntpLastSuccessMonth=1, ntpLastSuccessDay=1;
int ntpLastSuccessHour=0, ntpLastSuccessMinute=0, ntpLastSuccessSecond=0;
const char* NTP_META_FILE = "/ntp.json";

unsigned long lastNtpCheckMillis = 0;
bool ntpFirstCheckPending = true;
bool staEverConnectedThisBoot = false;

unsigned long resetMillis = 0;
bool pendingReset = false;

unsigned long lastToggleManualRequest = 0;
unsigned long lastSaveScenarioRequest = 0;
unsigned long lastSyncRequest = 0;
unsigned long lastSaveApRequest = 0;
unsigned long lastSaveStaRequest = 0;
unsigned long lastSaveProtectionRequest = 0;
unsigned long lastSaveApCycleRequest = 0;
unsigned long lastStatusRequest = 0;
unsigned long lastConfigRequest = 0;
unsigned long lastScenariosRequest = 0;

const char* TIME_FILES[2] = {"/time0.txt", "/time1.txt"};
int timeFileSlot = 0;
unsigned long timeSaveSeq = 0;
unsigned long lastTimeSaveMillis = 0;

unsigned long relaySwitchCount = 0;
unsigned long relayTotalOnSeconds = 0;
unsigned long relayOnSinceMillis = 0;
bool relayCurrentlyOnForStats = false;
int lastRelayStatState = -1;
const char* RELAY_STAT_FILES[2] = {"/relaystat0.txt", "/relaystat1.txt"};
int relayStatFileSlot = 0;
unsigned long relayStatSaveSeq = 0;
unsigned long lastRelayStatSaveMillis = 0;

void loadScenarios();
void saveScenarios();
void loadWiFiSettings();
void saveWiFiSettings();
void loadOverrideSetting();
void loadProtectionSettings();
void saveProtectionSettings();
void saveOverrideSetting();
void saveTimeSetting();
void loadTimeSetting();
bool readTimeFile(const char* path, int &h, int &m, int &s, int &sync, unsigned long &seq, int &y, int &mon, int &d, int &wd);
void advanceDate();
bool isLeapYear(int year);
void saveRelayStats();
void loadRelayStats();
bool readRelayStatFile(const char* path, unsigned long &sc, unsigned long &tos, unsigned long &seq);
void loadNtpSuccessInfo();
void saveNtpSuccessInfo();
void handleSaveScenario();
void handleSyncTime();
void handleGetStatus();
void handleToggleManual();
void handleSaveAP();
void handleSaveSTA();
void handleSaveProtection();
void handleSaveApCycle();
void handleGetConfig();
void handleGetScenarios();
bool allowRequest(unsigned long &lastRequest, unsigned long minIntervalMs);
void checkScenarios();
void updateClock();
void setRelay(bool state);
void applyApTxPower();
void setApRadioState(bool on);
void manageApCycle();
void setStaConnectionState(bool on);
void manageStaCycle();
void connectToInternetWiFi();
void tryNtpSync();
String encryptPassword(const char* password, size_t bufferSize);
void loadAndDecryptPassword(const char* savedValue, char* outputBuffer, size_t bufferSize);

