sargoliwork101-ui/ESP_APK_COOLLER/esp32_firmware/Cooler_ESP32_LightAPI/Cooler_ESP32_LightAPI.ino
bool allowRequest(unsigned long &lastRequest, unsigned long minIntervalMs) {
  unsigned long now = millis();
  if (lastRequest != 0 && (unsigned long)(now - lastRequest) < minIntervalMs) {
    sendCORS(); server.send(429, "text/plain", "Too Many Requests"); return false;
  }
  lastRequest = now;
  return true;
}

void setupWatchdog() {
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  esp_task_wdt_config_t twdt_config = { .timeout_ms = WDT_TIMEOUT_SEC * 1000, .idle_core_mask = (1 << portNUM_PROCESSORS) - 1, .trigger_panic = true };
  esp_task_wdt_init(&twdt_config);
#else
  esp_task_wdt_init(WDT_TIMEOUT_SEC, true);
#endif
  esp_task_wdt_add(NULL);
}
void feedWatchdog() { esp_task_wdt_reset(); }

void setRelay(bool state) {
  digitalWrite(RELAY_PIN, state ? RELAY_ACTIVE_LEVEL : !RELAY_ACTIVE_LEVEL);
}

void applyApTxPower() {
  wifi_power_t p;
  switch (apTxPowerLevel) {
    case 0:  p = WIFI_POWER_5dBm; break;
    case 1:  p = WIFI_POWER_11dBm; break;
    case 2:  p = WIFI_POWER_15dBm; break;
    default: p = WIFI_POWER_19_5dBm; break;
  }
  WiFi.setTxPower(p);
}
void setApRadioState(bool on) {
  if (on == apCurrentlyOn) return;
  if (on) { WiFi.softAP(custom_ssid, custom_password, 1, 0, 3); applyApTxPower(); }
  else    { WiFi.softAPdisconnect(true); }
  apCurrentlyOn = on;
}
void manageApCycle() {
  if (!apCycleEnabled) { if (!apCurrentlyOn) { setApRadioState(true); apCycleLastToggleMillis = millis(); } return; }
  if (apCurrentlyOn && WiFi.softAPgetStationNum() > 0) { apCycleLastToggleMillis = millis(); return; }
  unsigned long onMs  = (unsigned long)apOnMinutes  * 60000UL;
  unsigned long offMs = (unsigned long)apOffMinutes * 60000UL;
  unsigned long elapsed = millis() - apCycleLastToggleMillis;
  if (apCurrentlyOn && elapsed >= onMs)  { setApRadioState(false); apCycleLastToggleMillis = millis(); }
  else if (!apCurrentlyOn && elapsed >= offMs) { setApRadioState(true); apCycleLastToggleMillis = millis(); }
}

String encryptPassword(const char* password, size_t bufferSize) {
  if (strlen(password) == 0) return "";
  mbedtls_aes_context aes; mbedtls_aes_init(&aes); mbedtls_aes_setkey_enc(&aes, AES_KEY, 128);
  size_t paddedSize = (bufferSize + 15) / 16 * 16;
  unsigned char* input = (unsigned char*)calloc(paddedSize, 1);
  if (!input) return "";
  strncpy((char*)input, password, bufferSize - 1);
  unsigned char* output = (unsigned char*)calloc(paddedSize, 1);
  if (!output) { free(input); return ""; }
  for (size_t i = 0; i < paddedSize; i += 16) mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_ENCRYPT, input + i, output + i);
  mbedtls_aes_free(&aes);
  String hexString = "ENC:";
  for (size_t i = 0; i < paddedSize; i++) { char hex[3]; sprintf(hex, "%02x", output[i]); hexString += String(hex); }
  free(input); free(output);
  return hexString;
}
void loadAndDecryptPassword(const char* savedValue, char* outputBuffer, size_t bufferSize) {
  String val = String(savedValue);
  if (val.length() == 0) { outputBuffer[0] = '\0'; return; }
  if (val.startsWith("ENC:")) {
    String hexString = val.substring(4); size_t len = hexString.length();
    if (len % 32 != 0) return;
    size_t paddedSize = len / 2;
    unsigned char* input = (unsigned char*)calloc(paddedSize, 1);
    if (!input) return;
    for (size_t i = 0; i < paddedSize; i++) { char hex[3] = {hexString[i*2], hexString[i*2+1], '\0'}; input[i] = (unsigned char)strtol(hex, NULL, 16); }
    mbedtls_aes_context aes; mbedtls_aes_init(&aes); mbedtls_aes_setkey_dec(&aes, AES_KEY, 128);
    unsigned char* output = (unsigned char*)calloc(paddedSize, 1);
    if (!output) { free(input); return; }
    for (size_t i = 0; i < paddedSize; i += 16) mbedtls_aes_crypt_ecb(&aes, MBEDTLS_AES_DECRYPT, input + i, output + i);
    mbedtls_aes_free(&aes);
    size_t copySize = paddedSize < bufferSize ? paddedSize : bufferSize - 1;
    memcpy(outputBuffer, output, copySize); outputBuffer[copySize] = '\0';
    free(input); free(output);
  } else {
    strncpy(outputBuffer, savedValue, bufferSize - 1); outputBuffer[bufferSize - 1] = '\0';
  }
}

void setup() {
  Serial.begin(115200);
  setupWatchdog();
  if (!LittleFS.begin(true)) Serial.println("LittleFS Mount Failed!");
  loadScenarios(); loadWiFiSettings(); loadOverrideSetting(); loadProtectionSettings();
  loadTimeSetting(); loadRelayStats(); loadNtpSuccessInfo();
  pinMode(RELAY_PIN, OUTPUT);
  if (manual_override == 1) setRelay(true); else setRelay(false);
  lastRelayStatState = (manual_override == 1) ? 1 : 0;
  if (lastRelayStatState == 0) lastRelayOffMillis = millis();
  if (lastRelayStatState == 1) { relayOnSinceMillis = millis(); relayCurrentlyOnForStats = true; }

  WiFi.mode(WIFI_AP_STA);
  WiFi.persistent(false);
  WiFi.setAutoReconnect(true);
  WiFi.softAP(custom_ssid, custom_password, 1, 0, 3);
  applyApTxPower();
  apCurrentlyOn = true; apCycleLastToggleMillis = millis();
  staCurrentlyOn = true; staCycleLastToggleMillis = millis();
  connectToInternetWiFi();

  // Endpoints
  server.on("/", HTTP_GET, [](){
    sendCORS();
    server.send(200, "text/html; charset=utf-8",
      "<!DOCTYPE html><html dir=rtl lang=fa><head><meta charset=utf-8>"
      "<meta name=viewport content='width=device-width,initial-scale=1'>"
      "<title>" + String(PROGRAM_NAME) + "</title>"
      "<style>body{font-family:Vazirmatn,Tahoma,sans-serif;background:#0a0c0d;color:#eef0f1;text-align:center;padding:40px 20px;}"
      "h1{color:#1de9c4}code{background:#15181a;padding:4px 8px;border-radius:6px;color:#29d3c8;direction:ltr;display:inline-block;}</style>"
      "</head><body><h1>" + String(PROGRAM_NAME) + "</h1>"
      "<p>این دستگاه در حالت <b>Light-API</b> است.</p>"
      "<p>رابط کاربری توسط اپ موبایل یا PWA ارائه می‌شود؛ برد فقط داده می‌فرستد/می‌گیرد.</p>"
      "<p>API endpoints:<br>"
      "<code>GET  /status</code><br>"
      "<code>GET  /config</code><br>"
      "<code>GET  /scenarios</code><br>"
      "<code>POST /toggle-manual</code><br>"
      "<code>POST /sync?...&nbsp;&nbsp;</code><br>"
      "<code>POST /save</code> (JSON)<br>"
      "<code>POST /save-ap</code><br>"
      "<code>POST /save-sta</code><br>"
      "<code>POST /save-ap-cycle</code><br>"
      "<code>POST /save-protection</code>"
      "</p></body></html>");
  });
  server.on("/save", HTTP_POST, handleSaveScenario);
  server.on("/sync", HTTP_POST, handleSyncTime);
  server.on("/status", HTTP_GET, handleGetStatus);
  server.on("/config", HTTP_GET, handleGetConfig);
  server.on("/scenarios", HTTP_GET, handleGetScenarios);
  server.on("/toggle-manual", HTTP_POST, handleToggleManual);
  server.on("/save-ap", HTTP_POST, handleSaveAP);
  server.on("/save-sta", HTTP_POST, handleSaveSTA);
  server.on("/save-protection", HTTP_POST, handleSaveProtection);
  server.on("/save-ap-cycle", HTTP_POST, handleSaveApCycle);
  // CORS preflight
  server.onNotFound([](){
    if (server.method() == HTTP_OPTIONS) { handleOptions(); return; }
    sendCORS(); server.send(404, "text/plain", "Not Found");
  });
  server.begin();
  lastTick = millis();
  lastTimeSaveMillis = millis();
}

void loop() {
  feedWatchdog();
  static int lowHeapStreak = 0;
  if (ESP.getFreeHeap() < 2000) {
    lowHeapStreak++;
    if (lowHeapStreak >= 5) { Serial.println("Memory too low! Restarting."); saveTimeSetting(); ESP.restart(); }
  } else lowHeapStreak = 0;
  if (pendingReset && (millis() - resetMillis > 2000)) { saveTimeSetting(); ESP.restart(); }
  server.handleClient();
  updateClock();
  manageStaCycle();
  tryNtpSync();
  checkScenarios();
  manageApCycle();
  if (time_synchronized && (millis() - lastTimeSaveMillis >= TIME_SAVE_INTERVAL)) saveTimeSetting();
  if (relayCurrentlyOnForStats && (millis() - lastRelayStatSaveMillis >= TIME_SAVE_INTERVAL)) {
    unsigned long elapsedSec = (millis() - relayOnSinceMillis) / 1000UL;
    relayTotalOnSeconds += elapsedSec; relayOnSinceMillis += elapsedSec * 1000UL;
    saveRelayStats();
  }
  static unsigned long lastTxPowerRefresh = 0;
  if (millis() - lastTxPowerRefresh >= 30000UL) { applyApTxPower(); lastTxPowerRefresh = millis(); }
  static unsigned long lastPinModeRefresh = 0;
  if (millis() - lastPinModeRefresh >= 30000UL) { pinMode(RELAY_PIN, OUTPUT); lastPinModeRefresh = millis(); }
  yield();
}

void updateClock() {
  while (millis() - lastTick >= 1000) {
    lastTick += 1000; currentSecond++;
    if (currentSecond >= 60) {
      currentSecond = 0; currentMinute++;
      if (currentMinute >= 60) { currentMinute = 0; currentHour++; if (currentHour >= 24) { currentHour = 0; advanceDate(); } }
    }
  }
}
bool isLeapYear(int year) { return (year%4==0 && year%100!=0) || (year%400==0); }
void advanceDate() {
  const int dim[]={31,28,31,30,31,30,31,31,30,31,30,31};
  int md = dim[currentMonth-1];
  if (currentMonth==2 && isLeapYear(currentYear)) md=29;
  currentDay++;
  if (currentDay>md){currentDay=1;currentMonth++;if(currentMonth>12){currentMonth=1;currentYear++;}}
  currentWeekday=(currentWeekday+1)%7;
}

