sargoliwork101-ui/ESP_APK_COOLLER/esp32_firmware/Cooler_ESP32_LightAPI/Cooler_ESP32_LightAPI.ino
void checkScenarios() {
  static int lastKnownState = -1;
  bool desiredState;
  if (manual_override == 1) {
    desiredState = true;
    if (lastKnownState != 1) { if (time_synchronized) saveTimeSetting(); lastKnownState = 1; }
  } else if (!time_synchronized) {
    desiredState = false;
    if (lastKnownState != 0) lastKnownState = 0;
  } else {
    desiredState = false;
    int cur = currentHour*60 + currentMinute;
    for (int i=0;i<MAX_SCENARIOS;i++){
      if (!scenarios[i].active || !scenarios[i].enabled) continue;
      int s = scenarios[i].startHour*60+scenarios[i].startMinute;
      int e = scenarios[i].endHour*60+scenarios[i].endMinute;
      uint8_t wd = scenarios[i].weekdays;
      if (s == e || wd == 0) continue;
      int sd = currentWeekday;
      if (s>e && cur<e) sd = (currentWeekday+6)%7;
      if ((wd & (1<<sd))==0) continue;
      bool in = (s<e) ? (cur>=s && cur<e) : (cur>=s || cur<e);
      if (in){ desiredState = true; break; }
    }
    int n = desiredState?1:0;
    if (lastKnownState != n){ saveTimeSetting(); lastKnownState = n; }
  }
  if (desiredState && antiShortCycleMinutes>0 && lastRelayStatState==0){
    unsigned long req = (unsigned long)antiShortCycleMinutes*60UL*1000UL;
    if (millis()-lastRelayOffMillis < req) desiredState = false;
  }
  int nrs = desiredState?1:0;
  if (lastRelayStatState != nrs){
    if (nrs == 1){ relaySwitchCount++; relayOnSinceMillis=millis(); relayCurrentlyOnForStats=true; }
    else { if (relayCurrentlyOnForStats){ relayTotalOnSeconds += (millis()-relayOnSinceMillis)/1000UL; } relayCurrentlyOnForStats=false; lastRelayOffMillis=millis(); }
    lastRelayStatState = nrs; saveRelayStats();
  }
  setRelay(desiredState);
}

void loadScenarios() {
  if (!LittleFS.exists("/scenarios.json")) return;
  File f = LittleFS.open("/scenarios.json","r"); if (!f) return;
  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  DeserializationError err = deserializeJson(doc, f); f.close();
  if (err) return;
  JsonArray arr = doc.is<JsonArray>() ? doc.as<JsonArray>() : doc["items"].as<JsonArray>();
  int i=0;
  for (JsonObject v : arr){
    if (i>=MAX_SCENARIOS) break;
    bool a = v["active"] | false;
    scenarios[i].active = a;
    scenarios[i].enabled = v.containsKey("en") ? (bool)v["en"] : a;
    scenarios[i].startHour = v["sh"]|0; scenarios[i].startMinute=v["sm"]|0;
    scenarios[i].endHour=v["eh"]|0; scenarios[i].endMinute=v["em"]|0;
    scenarios[i].weekdays = v.containsKey("wd") ? (uint8_t)(v["wd"]|0x7F) : 0x7F;
    i++;
  }
}
void saveScenarios() {
  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  JsonObject root = doc.to<JsonObject>(); root["version"]=SCENARIOS_FILE_VERSION;
  JsonArray arr = root.createNestedArray("items");
  for (int i=0;i<MAX_SCENARIOS;i++){
    JsonObject o = arr.createNestedObject();
    o["active"]=scenarios[i].active; o["en"]=scenarios[i].enabled;
    o["sh"]=scenarios[i].startHour; o["sm"]=scenarios[i].startMinute;
    o["eh"]=scenarios[i].endHour; o["em"]=scenarios[i].endMinute;
    o["wd"]=scenarios[i].weekdays;
  }
  File f = LittleFS.open("/scenarios.json","w"); if (!f) return;
  size_t w = serializeJson(doc,f); f.close();
  if (w==0) LittleFS.remove("/scenarios.json");
}

void loadWiFiSettings() {
  if (!LittleFS.exists("/wifi.json")) return;
  File f = LittleFS.open("/wifi.json","r"); if (!f) return;
  StaticJsonDocument<1024> doc; DeserializationError e = deserializeJson(doc,f); f.close();
  if (e) return;
  if (doc.containsKey("ssid")) { strncpy(custom_ssid, doc["ssid"], 31); custom_ssid[31]='\0'; }
  if (doc.containsKey("pass"))  { loadAndDecryptPassword(doc["pass"], custom_password, 32); }
  if (doc.containsKey("sta_ssid")){ strncpy(sta_ssid, doc["sta_ssid"], 31); sta_ssid[31]='\0'; }
  if (doc.containsKey("sta_pass")){ loadAndDecryptPassword(doc["sta_pass"], sta_password, 64); }
  if (doc.containsKey("internet")) internet_enabled = doc["internet"]|true;
  if (doc.containsKey("staEnabled") && !doc.containsKey("staOnMinutes") && !doc.containsKey("staOffMinutes")){
    if (!(doc["staEnabled"]|true)) internet_enabled = false;
  }
  if (doc.containsKey("staOnMinutes"))  { int v=doc["staOnMinutes"]|staOnMinutes;  staOnMinutes=constrain(v,MIN_STA_ON_MINUTES,MAX_STA_CYCLE_MINUTES); }
  if (doc.containsKey("staOffMinutes")) { int v=doc["staOffMinutes"]|staOffMinutes; staOffMinutes=constrain(v,MIN_STA_OFF_MINUTES,MAX_STA_CYCLE_MINUTES); }
  if (doc.containsKey("apCycleEnabled")) apCycleEnabled = doc["apCycleEnabled"]|false;
  if (doc.containsKey("apOnMinutes"))   { int v=doc["apOnMinutes"]|apOnMinutes;   apOnMinutes=constrain(v,MIN_AP_CYCLE_MINUTES,MAX_AP_CYCLE_MINUTES); }
  if (doc.containsKey("apOffMinutes"))  { int v=doc["apOffMinutes"]|apOffMinutes;  apOffMinutes=constrain(v,MIN_AP_CYCLE_MINUTES,MAX_AP_CYCLE_MINUTES); }
  if (doc.containsKey("apTxPowerLevel")){ int v=doc["apTxPowerLevel"]|apTxPowerLevel; apTxPowerLevel=constrain(v,0,MAX_AP_TX_POWER_LEVEL); }
}
void saveWiFiSettings() {
  StaticJsonDocument<1024> doc;
  doc["version"]=WIFI_FILE_VERSION; doc["ssid"]=custom_ssid;
  doc["pass"]=encryptPassword(custom_password,32);
  doc["sta_ssid"]=sta_ssid;
  doc["sta_pass"]=encryptPassword(sta_password,64);
  doc["internet"]=internet_enabled;
  doc["staOnMinutes"]=staOnMinutes; doc["staOffMinutes"]=staOffMinutes;
  doc["apCycleEnabled"]=apCycleEnabled; doc["apOnMinutes"]=apOnMinutes; doc["apOffMinutes"]=apOffMinutes; doc["apTxPowerLevel"]=apTxPowerLevel;
  File f=LittleFS.open("/wifi.json","w"); if(!f) return;
  size_t w=serializeJson(doc,f); f.close();
  if(w==0) LittleFS.remove("/wifi.json");
}

void loadOverrideSetting(){
  manual_override=0;
  if(!LittleFS.exists("/override.txt")) return;
  File f=LittleFS.open("/override.txt","r"); if(!f) return;
  String v=f.readString(); f.close();
  manual_override = v.startsWith("V")? v.substring(v.indexOf(':')+1).toInt() : v.toInt();
  manual_override = (manual_override==1)?1:0;
}
void saveOverrideSetting(){
  File f=LittleFS.open("/override.txt","w"); if(!f) return;
  f.printf("V%d:%d",OVERRIDE_FILE_VERSION,manual_override); f.close();
}
void loadProtectionSettings(){
  if(!LittleFS.exists("/protection.json")) return;
  File f=LittleFS.open("/protection.json","r"); if(!f) return;
  StaticJsonDocument<128> doc; DeserializationError e=deserializeJson(doc,f); f.close();
  if(!e && doc.containsKey("minOffMinutes")){
    int v=doc["minOffMinutes"]|3; antiShortCycleMinutes=constrain(v,0,MAX_ANTI_SHORT_CYCLE_MINUTES);
  }
}
void saveProtectionSettings(){
  StaticJsonDocument<128> doc; doc["version"]=PROTECTION_FILE_VERSION; doc["minOffMinutes"]=antiShortCycleMinutes;
  File f=LittleFS.open("/protection.json","w"); if(!f) return;
  size_t w=serializeJson(doc,f); f.close();
  if(w==0) LittleFS.remove("/protection.json");
}

