sargoliwork101-ui/ESP_APK_COOLLER/esp32_firmware/Cooler_ESP32_LightAPI/Cooler_ESP32_LightAPI.ino
void saveTimeSetting(){
  timeSaveSeq++; timeFileSlot=1-timeFileSlot;
  File f=LittleFS.open(TIME_FILES[timeFileSlot],"w"); if(!f) return;
  size_t w=f.printf("V%d:%d:%d:%d:%d:%lu:%d:%d:%d:%d",TIME_FILE_VERSION,currentHour,currentMinute,currentSecond,time_synchronized?1:0,timeSaveSeq,currentYear,currentMonth,currentDay,currentWeekday);
  f.close(); if(w==0) LittleFS.remove(TIME_FILES[timeFileSlot]);
  lastTimeSaveMillis=millis();
}
bool readTimeFile(const char*p,int&h,int&m,int&s,int&sy,unsigned long&sq,int&y,int&mo,int&d,int&wd){
  if(!LittleFS.exists(p)) return false;
  File f=LittleFS.open(p,"r"); if(!f) return false;
  String v=f.readString(); f.close();
  int th=-1,tm=-1,ts=-1,tsync=-1,ty=2026,tmon=1,td=1,twd=3,fv=1;
  unsigned long tseq=0; int pr;
  if(v.startsWith("V")) pr=sscanf(v.c_str(),"V%d:%d:%d:%d:%d:%lu:%d:%d:%d:%d",&fv,&th,&tm,&ts,&tsync,&tseq,&ty,&tmon,&td,&twd);
  else pr=sscanf(v.c_str(),"%d:%d:%d:%d:%lu:%d:%d:%d:%d",&th,&tm,&ts,&tsync,&tseq,&ty,&tmon,&td,&twd);
  if(pr<4||th<0||th>23||tm<0||tm>59||ts<0||ts>59||(tsync!=0&&tsync!=1)) return false;
  if((fv>=2||pr>=9)&&(ty<2024||tmon<1||tmon>12||td<1||td>31||twd<0||twd>6)) return false;
  h=th;m=tm;s=ts;sy=tsync;y=ty;mo=tmon;d=td;wd=twd;
  sq=((fv>=2&&pr>=10)||(fv==1&&pr>=9))?tseq:0;
  return true;
}
void loadTimeSetting(){
  int h0,m0,s0,s0_,y0,mo0,d0,wd0; unsigned long q0;
  int h1,m1,s1,s1_,y1,mo1,d1,wd1; unsigned long q1;
  bool o0=readTimeFile(TIME_FILES[0],h0,m0,s0,s0_,q0,y0,mo0,d0,wd0);
  bool o1=readTimeFile(TIME_FILES[1],h1,m1,s1,s1_,q1,y1,mo1,d1,wd1);
  if(o0&&o1){ if(q1>=q0)o0=false; else o1=false; }
  if(o0){currentHour=h0;currentMinute=m0;currentSecond=s0;currentYear=y0;currentMonth=mo0;currentDay=d0;currentWeekday=wd0;time_synchronized=(s0_==1&&q0>0);timeFileSlot=0;timeSaveSeq=q0;}
  else if(o1){currentHour=h1;currentMinute=m1;currentSecond=s1;currentYear=y1;currentMonth=mo1;currentDay=d1;currentWeekday=wd1;time_synchronized=(s1_==1&&q1>0);timeFileSlot=1;timeSaveSeq=q1;}
  else {currentHour=0;currentMinute=0;currentSecond=0;time_synchronized=false;}
}

void saveRelayStats(){
  relayStatSaveSeq++; relayStatFileSlot=1-relayStatFileSlot;
  File f=LittleFS.open(RELAY_STAT_FILES[relayStatFileSlot],"w"); if(!f) return;
  size_t w=f.printf("V%d:%lu:%lu:%lu",RELAY_STAT_FILE_VERSION,relaySwitchCount,relayTotalOnSeconds,relayStatSaveSeq); f.close();
  if(w==0) LittleFS.remove(RELAY_STAT_FILES[relayStatFileSlot]);
  lastRelayStatSaveMillis=millis();
}
bool readRelayStatFile(const char*p,unsigned long&sc,unsigned long&tos,unsigned long&sq){
  if(!LittleFS.exists(p)) return false;
  File f=LittleFS.open(p,"r"); if(!f) return false;
  String v=f.readString(); f.close();
  unsigned long tsc=0,ttos=0,tseq=0; int fv=1;
  int pr=v.startsWith("V")?sscanf(v.c_str(),"V%d:%lu:%lu:%lu",&fv,&tsc,&ttos,&tseq):sscanf(v.c_str(),"%lu:%lu:%lu",&tsc,&ttos,&tseq);
  if(pr!=(v.startsWith("V")?4:3)) return false;
  sc=tsc;tos=ttos;sq=tseq; return true;
}
void loadRelayStats(){
  unsigned long sc0,tos0,sq0,sc1,tos1,sq1;
  bool o0=readRelayStatFile(RELAY_STAT_FILES[0],sc0,tos0,sq0);
  bool o1=readRelayStatFile(RELAY_STAT_FILES[1],sc1,tos1,sq1);
  if(o0&&o1){ if(sq1>=sq0)o0=false; else o1=false; }
  if(o0){relaySwitchCount=sc0;relayTotalOnSeconds=tos0;relayStatFileSlot=0;relayStatSaveSeq=sq0;}
  else if(o1){relaySwitchCount=sc1;relayTotalOnSeconds=tos1;relayStatFileSlot=1;relayStatSaveSeq=sq1;}
  else {relaySwitchCount=0;relayTotalOnSeconds=0;}
}

void loadNtpSuccessInfo(){
  ntpLastSuccessValid=false;
  if(!LittleFS.exists(NTP_META_FILE)) return;
  File f=LittleFS.open(NTP_META_FILE,"r"); if(!f) return;
  StaticJsonDocument<192> doc; DeserializationError e=deserializeJson(doc,f); f.close();
  if(e) return;
  int y=doc["y"]|0,mon=doc["mon"]|0,d=doc["d"]|0,h=doc["h"]|-1,m=doc["m"]|-1,s=doc["s"]|-1;
  if(y<2024||mon<1||mon>12||d<1||d>31||h<0||h>23||m<0||m>59||s<0||s>59) return;
  ntpLastSuccessYear=y;ntpLastSuccessMonth=mon;ntpLastSuccessDay=d;
  ntpLastSuccessHour=h;ntpLastSuccessMinute=m;ntpLastSuccessSecond=s;
  ntpLastSuccessValid=true;ntpEverSucceeded=true;
}
void saveNtpSuccessInfo(){
  if(!ntpLastSuccessValid) return;
  StaticJsonDocument<192> doc;
  doc["version"]=NTP_META_FILE_VERSION;
  doc["y"]=ntpLastSuccessYear;doc["mon"]=ntpLastSuccessMonth;doc["d"]=ntpLastSuccessDay;
  doc["h"]=ntpLastSuccessHour;doc["m"]=ntpLastSuccessMinute;doc["s"]=ntpLastSuccessSecond;
  File f=LittleFS.open(NTP_META_FILE,"w"); if(!f) return;
  size_t w=serializeJson(doc,f); f.close();
  if(w==0) LittleFS.remove(NTP_META_FILE);
}

void setStaConnectionState(bool on){
  if(on){ staCurrentlyOn=true; staCycleLastToggleMillis=millis(); connectToInternetWiFi(); }
  else { WiFi.setAutoReconnect(false); WiFi.disconnect(false); staCurrentlyOn=false; staCycleLastToggleMillis=millis(); staEverConnectedThisBoot=false; }
}
void manageStaCycle(){
  if(!internet_enabled || strlen(sta_ssid)==0){
    if(staCurrentlyOn||WiFi.status()==WL_CONNECTED){ WiFi.setAutoReconnect(false); WiFi.disconnect(false); staCurrentlyOn=false; }
    staCycleLastToggleMillis=millis(); return;
  }
  if(staOffMinutes==0){ if(!staCurrentlyOn) setStaConnectionState(true); return; }
  unsigned long onMs=(unsigned long)staOnMinutes*60000UL, offMs=(unsigned long)staOffMinutes*60000UL;
  unsigned long el=millis()-staCycleLastToggleMillis;
  if(staCurrentlyOn && el>=onMs) setStaConnectionState(false);
  else if(!staCurrentlyOn && el>=offMs) setStaConnectionState(true);
}
void connectToInternetWiFi(){
  if(!internet_enabled){ WiFi.setAutoReconnect(false); WiFi.disconnect(false); return; }
  if(strlen(sta_ssid)==0){ WiFi.setAutoReconnect(false); WiFi.disconnect(false); return; }
  WiFi.setAutoReconnect(true);
  if(strlen(sta_password)>0) WiFi.begin(sta_ssid,sta_password); else WiFi.begin(sta_ssid);
  configTime(NTP_GMT_OFFSET_SEC,0,"ir.pool.ntp.org","ntp.nic.ir","pool.ntp.org");
  applyApTxPower();
}
void tryNtpSync(){
  unsigned long iv = ntp_synced_this_boot ? NTP_RECHECK_INTERVAL_MS : NTP_RETRY_INTERVAL_MS;
  if(!internet_enabled||!staCurrentlyOn||strlen(sta_ssid)==0) return;
  if(ntpFirstCheckPending){ ntpFirstCheckPending=false; }
  else if(millis()-lastNtpCheckMillis<iv) return;
  if(WiFi.status()!=WL_CONNECTED) return;
  lastNtpCheckMillis=millis();
  time_t now=time(nullptr); struct tm* t=localtime(&now);
  if(t && (t->tm_year+1900)>=2024){
    currentHour=t->tm_hour;currentMinute=t->tm_min;currentSecond=t->tm_sec;
    currentYear=t->tm_year+1900;currentMonth=t->tm_mon+1;currentDay=t->tm_mday;
    currentWeekday=(t->tm_wday+1)%7; lastTick=millis();
    time_synchronized=true; ntp_synced_this_boot=true; ntpEverSucceeded=true;
    ntpLastSuccessYear=currentYear;ntpLastSuccessMonth=currentMonth;ntpLastSuccessDay=currentDay;
    ntpLastSuccessHour=currentHour;ntpLastSuccessMinute=currentMinute;ntpLastSuccessSecond=currentSecond;
    ntpLastSuccessValid=true;
    saveTimeSetting(); saveNtpSuccessInfo();
  }
}

// ===================== Handlers =====================
void handleSyncTime(){
  if(!allowRequest(lastSyncRequest,1000UL)) return;
  sendCORS();
  if(server.hasArg("h")&&server.hasArg("m")&&server.hasArg("s")&&server.hasArg("y")&&server.hasArg("mon")&&server.hasArg("d")&&server.hasArg("wd")){
    int h=server.arg("h").toInt(),m=server.arg("m").toInt(),s=server.arg("s").toInt();
    int y=server.arg("y").toInt(),mon=server.arg("mon").toInt(),d=server.arg("d").toInt(),wd=server.arg("wd").toInt();
    if(h<0||h>23||m<0||m>59||s<0||s>59||y<2024||mon<1||mon>12||d<1||d>31||wd<0||wd>6){ server.send(400,"text/plain","Invalid Time Range"); return; }
    currentHour=h;currentMinute=m;currentSecond=s;currentYear=y;currentMonth=mon;currentDay=d;currentWeekday=wd;
    lastTick=millis(); time_synchronized=true; saveTimeSetting(); server.send(200,"text/plain","OK");
  } else server.send(400,"text/plain","Bad Request");
}

void handleToggleManual(){
  if(!allowRequest(lastToggleManualRequest,1500UL)) return;
  sendCORS();
  if(manual_override==0){ manual_override=1; saveOverrideSetting(); if(time_synchronized) saveTimeSetting(); delay(100); checkScenarios(); }
  else { manual_override=0; saveOverrideSetting(); if(time_synchronized) saveTimeSetting(); delay(100); checkScenarios(); }
  server.send(200,"text/plain","OK");
}

