sargoliwork101-ui/ESP_APK_COOLLER/esp32_firmware/Cooler_ESP32_LightAPI/Cooler_ESP32_LightAPI.ino
void handleSaveAP(){
  if(!allowRequest(lastSaveApRequest,3000UL)) return;
  sendCORS();
  if(server.hasArg("ssid")&&server.hasArg("pass")){
    String ns=server.arg("ssid"),np=server.arg("pass");
    if(ns.length()>0&&np.length()>=8){
      ns.toCharArray(custom_ssid,32); np.toCharArray(custom_password,32);
      saveWiFiSettings(); saveTimeSetting();
      server.send(200,"text/plain","OK");
      pendingReset=true; resetMillis=millis(); return;
    }
  }
  server.send(400,"text/plain","Bad Request");
}

void handleSaveSTA(){
  if(!allowRequest(lastSaveStaRequest,1500UL)) return;
  sendCORS();
  String ns=server.hasArg("sta_ssid")?server.arg("sta_ssid"):"";
  String np=server.hasArg("sta_pass")?server.arg("sta_pass"):"";
  String ni=server.hasArg("internet")?server.arg("internet"):"";
  String non=server.hasArg("sta_on_minutes")?server.arg("sta_on_minutes"):"";
  String noff=server.hasArg("sta_off_minutes")?server.arg("sta_off_minutes"):"";
  if(np.length()>0&&np.length()<8){ server.send(400,"text/plain","Bad Request"); return; }
  if(non.length()==0||noff.length()==0){ server.send(400,"text/plain","Bad Request"); return; }
  for(size_t i=0;i<non.length();i++) if(!isDigit(non[i])){ server.send(400,"text/plain","Bad Request"); return; }
  for(size_t i=0;i<noff.length();i++) if(!isDigit(noff[i])){ server.send(400,"text/plain","Bad Request"); return; }
  int ov=non.toInt(),fv=noff.toInt();
  if(ov<MIN_STA_ON_MINUTES||ov>MAX_STA_CYCLE_MINUTES||fv<MIN_STA_OFF_MINUTES||fv>MAX_STA_CYCLE_MINUTES){ server.send(400,"text/plain","Bad Request"); return; }
  internet_enabled=(ni=="1"); staOnMinutes=ov; staOffMinutes=fv;
  ns.toCharArray(sta_ssid,32); np.toCharArray(sta_password,64);
  saveWiFiSettings();
  ntp_synced_this_boot=false; ntpFirstCheckPending=true; lastNtpCheckMillis=0; staEverConnectedThisBoot=false;
  WiFi.setAutoReconnect(false); WiFi.disconnect(false);
  staCurrentlyOn=true; staCycleLastToggleMillis=millis(); connectToInternetWiFi();
  server.send(200,"text/plain","OK");
}

void handleSaveProtection(){
  if(!allowRequest(lastSaveProtectionRequest,1000UL)) return;
  sendCORS();
  if(!server.hasArg("min_off")){ server.send(400,"text/plain","Bad Request"); return; }
  String v=server.arg("min_off");
  if(v.length()==0){ server.send(400,"text/plain","Bad Request"); return; }
  for(size_t i=0;i<v.length();i++) if(!isDigit(v[i])){ server.send(400,"text/plain","Bad Request"); return; }
  int x=v.toInt();
  if(x<0||x>MAX_ANTI_SHORT_CYCLE_MINUTES){ server.send(400,"text/plain","Bad Request"); return; }
  antiShortCycleMinutes=x; saveProtectionSettings(); server.send(200,"text/plain","OK");
}

void handleSaveApCycle(){
  if(!allowRequest(lastSaveApCycleRequest,1000UL)) return;
  sendCORS();
  if(!server.hasArg("on_minutes")||!server.hasArg("off_minutes")||!server.hasArg("tx_power")){ server.send(400,"text/plain","Bad Request"); return; }
  String onR=server.arg("on_minutes"),ofR=server.arg("off_minutes"),pR=server.arg("tx_power"),enR=server.hasArg("cycle_enabled")?server.arg("cycle_enabled"):"";
  if(onR.length()==0||ofR.length()==0||pR.length()==0){ server.send(400,"text/plain","Bad Request"); return; }
  for(size_t i=0;i<onR.length();i++) if(!isDigit(onR[i])){ server.send(400,"text/plain","Bad Request"); return; }
  for(size_t i=0;i<ofR.length();i++) if(!isDigit(ofR[i])){ server.send(400,"text/plain","Bad Request"); return; }
  for(size_t i=0;i<pR.length();i++)  if(!isDigit(pR[i])) { server.send(400,"text/plain","Bad Request"); return; }
  int on=onR.toInt(),of=ofR.toInt(),pv=pR.toInt();
  if(on<MIN_AP_CYCLE_MINUTES||on>MAX_AP_CYCLE_MINUTES||of<MIN_AP_CYCLE_MINUTES||of>MAX_AP_CYCLE_MINUTES||pv<0||pv>MAX_AP_TX_POWER_LEVEL){ server.send(400,"text/plain","Bad Request"); return; }
  apCycleEnabled=(enR=="1"); apOnMinutes=on; apOffMinutes=of; apTxPowerLevel=pv; applyApTxPower();
  apCycleLastToggleMillis=millis(); if(!apCurrentlyOn) setApRadioState(true);
  saveWiFiSettings(); server.send(200,"text/plain","OK");
}

void handleSaveScenario(){
  if(!allowRequest(lastSaveScenarioRequest,1200UL)) return;
  sendCORS();
  if(!server.hasArg("plain")){ server.send(400,"text/plain","Bad Request"); return; }
  String b=server.arg("plain");
  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  DeserializationError err=deserializeJson(doc,b);
  if(err||!doc.is<JsonArray>()){ server.send(400,"text/plain","Invalid JSON"); return; }
  JsonArray arr=doc.as<JsonArray>();
  Scenario tmp[MAX_SCENARIOS]; int i=0;
  for(JsonObject v:arr){
    if(i>=MAX_SCENARIOS) break;
    tmp[i].active=true;
    tmp[i].enabled=v["en"]|true;
    tmp[i].startHour=v["sh"]|0; tmp[i].startMinute=v["sm"]|0;
    tmp[i].endHour=v["eh"]|0;   tmp[i].endMinute=v["em"]|0;
    tmp[i].weekdays=v.containsKey("wd")?(uint8_t)(v["wd"]|0x7F):0x7F;
    i++;
  }
  bool ch=false;
  for(int j=0;j<MAX_SCENARIOS;j++){
    if(scenarios[j].active!=tmp[j].active||scenarios[j].enabled!=tmp[j].enabled||
       scenarios[j].startHour!=tmp[j].startHour||scenarios[j].startMinute!=tmp[j].startMinute||
       scenarios[j].endHour!=tmp[j].endHour||scenarios[j].endMinute!=tmp[j].endMinute||
       scenarios[j].weekdays!=tmp[j].weekdays){ ch=true; break; }
  }
  if(ch){ for(int j=0;j<MAX_SCENARIOS;j++) scenarios[j]=tmp[j]; saveScenarios(); }
  server.send(200,"text/plain","Updated");
}

void handleGetStatus(){
  if(!allowRequest(lastStatusRequest,150UL)) return;
  sendCORS();
  char ts[9]; sprintf(ts,"%02d:%02d:%02d",currentHour,currentMinute,currentSecond);
  int logState=(digitalRead(RELAY_PIN)==RELAY_ACTIVE_LEVEL)?1:0;
  int stac=(WiFi.status()==WL_CONNECTED)?1:0;
  int stacfg=(strlen(sta_ssid)>0)?1:0;
  char sip[16]="";
  if(stac){ IPAddress ip=WiFi.localIP(); snprintf(sip,sizeof(sip),"%u.%u.%u.%u",ip[0],ip[1],ip[2],ip[3]); }
  int staState;
  if(!internet_enabled||!stacfg) staState=0;
  else if(staOffMinutes>0 && !staCurrentlyOn) staState=4;
  else if(stac){ staEverConnectedThisBoot=true; staState=2; }
  else if(staEverConnectedThisBoot) staState=3;
  else staState=1;
  unsigned long liveOn=relayTotalOnSeconds;
  if(relayCurrentlyOnForStats) liveOn += (millis()-relayOnSinceMillis)/1000UL;
  long protRem=0;
  if(antiShortCycleMinutes>0 && lastRelayStatState==0){
    unsigned long req=(unsigned long)antiShortCycleMinutes*60UL*1000UL;
    unsigned long el=millis()-lastRelayOffMillis;
    if(el<req) protRem=(long)((req-el+999UL)/1000UL);
  }
  int apClients = apCurrentlyOn ? WiFi.softAPgetStationNum() : 0;
  long apRem=0;
  if(apCycleEnabled){
    unsigned long ph=apCurrentlyOn?((unsigned long)apOnMinutes*60000UL):((unsigned long)apOffMinutes*60000UL);
    unsigned long el=millis()-apCycleLastToggleMillis;
    if(el<ph) apRem=(long)((ph-el+999UL)/1000UL);
  }
  long staRem=0;
  if(internet_enabled && stacfg && staOffMinutes>0){
    unsigned long ph=staCurrentlyOn?((unsigned long)staOnMinutes*60000UL):((unsigned long)staOffMinutes*60000UL);
    unsigned long el=millis()-staCycleLastToggleMillis;
    if(el<ph) staRem=(long)((ph-el+999UL)/1000UL);
  }
  char json[1152];
  snprintf(json,sizeof(json),
    "{\"time\":\"%s\",\"relay\":%d,\"override\":%d,\"sync\":%d,\"sta\":%d,\"internetEnabled\":%d,\"staConfigured\":%d,"
    "\"staState\":%d,\"staIp\":\"%s\",\"staOnMinutes\":%d,\"staOffMinutes\":%d,\"staPhaseOn\":%d,\"staRemaining\":%ld,"
    "\"ntpOk\":%d,\"ntpLastValid\":%d,\"ntpYear\":%d,\"ntpMonth\":%d,\"ntpDay\":%d,\"ntpHour\":%d,\"ntpMinute\":%d,\"ntpSecond\":%d,"
    "\"switchCount\":%lu,\"onSeconds\":%lu,\"weekday\":%d,\"year\":%d,\"month\":%d,\"day\":%d,\"protectionMinutes\":%d,\"protectionRemaining\":%ld,"
    "\"apCycleEnabled\":%d,\"apOn\":%d,\"apOnMinutes\":%d,\"apOffMinutes\":%d,\"apTxPowerLevel\":%d,\"apRemaining\":%ld,\"apClientConnected\":%d}",
    ts,logState,manual_override,time_synchronized?1:0,stac,internet_enabled?1:0,stacfg,staState,sip,
    staOnMinutes,staOffMinutes,staCurrentlyOn?1:0,staRem,
    ntpEverSucceeded?1:0,ntpLastSuccessValid?1:0,ntpLastSuccessYear,ntpLastSuccessMonth,ntpLastSuccessDay,
    ntpLastSuccessHour,ntpLastSuccessMinute,ntpLastSuccessSecond,relaySwitchCount,liveOn,currentWeekday,
    currentYear,currentMonth,currentDay,antiShortCycleMinutes,protRem,
    apCycleEnabled?1:0,apCurrentlyOn?1:0,apOnMinutes,apOffMinutes,apTxPowerLevel,apRem,(apClients>0)?1:0);
  server.send(200,"application/json",json);
}

// endpoint جدید: تنظیمات (برای پر کردن فرم‌های تب وای‌فای در اپ)
void handleGetConfig(){
  if(!allowRequest(lastConfigRequest,1000UL)) return;
  sendCORS();
  StaticJsonDocument<512> doc;
  doc["apSsid"] = custom_ssid;
  // توجه: هرگز پسورد AP/STA برگردانده نمی‌شود (امنیت)
  doc["staSsid"] = sta_ssid;
  doc["internetEnabled"] = internet_enabled;
  doc["staOnMinutes"] = staOnMinutes; doc["staOffMinutes"] = staOffMinutes;
  doc["apCycleEnabled"] = apCycleEnabled; doc["apOnMinutes"]=apOnMinutes; doc["apOffMinutes"]=apOffMinutes;
  doc["apTxPowerLevel"] = apTxPowerLevel;
  doc["minOffMinutes"] = antiShortCycleMinutes;
  doc["deviceName"] = PROGRAM_NAME; doc["deviceTag"] = PROGRAM_TAGLINE;
  String out; serializeJson(doc,out);
  server.send(200,"application/json",out);
}

// endpoint جدید: سناریوهای فعلی (برای پر کردن خودکار فرم سناریوها در اپ)
void handleGetScenarios(){
  if(!allowRequest(lastScenariosRequest,1000UL)) return;
  sendCORS();
  DynamicJsonDocument doc(SCENARIOS_JSON_CAPACITY);
  JsonArray arr = doc.to<JsonArray>();
  for(int i=0;i<MAX_SCENARIOS;i++){
    if(!scenarios[i].active) continue;
    JsonObject o = arr.createNestedObject();
    o["sh"]=scenarios[i].startHour; o["sm"]=scenarios[i].startMinute;
    o["eh"]=scenarios[i].endHour;   o["em"]=scenarios[i].endMinute;
    o["en"]=scenarios[i].enabled;
    o["wd"]=scenarios[i].weekdays;
  }
  String out; serializeJson(doc,out);
  server.send(200,"application/json",out);
}
